app/controllers/candidatos_controller.rb

SELECT * FROM `candidatos` WHERE (`candidatos`.`id` = 1)
---
  def show
    @candidato = Candidato.find(params[:id])

INSERT INTO `candidatos` (`nome_urna`, `nome_completo`, `data_nas`, `created_at`, `cpf`, `grau_instr`, `updated_at`, `nacionalidade`, `estado_civil`, `sexo`, `ocupacao`, `cod_candidato`, `naturalidade`) VALUES('rod', 'werwerwerwer', '2010-11-07 21:08:00', '2010-11-07 21:09:17', 123123213213, 'qweqweqe', '2010-11-07 21:09:17', 'qweqweqweqw', 'qweqwewqe', 'qwewqeqwe', 'qewqeqeq', 123, 'qweqwe')
---
  def create
    @candidato = Candidato.new(params[:candidato])

    respond_to do |format|
      if @candidato.save