app/controllers/eleitors_controller.rb

SELECT * FROM `eleitors` WHERE (`eleitors`.`id` = 1)
---
  def show
    @eleitor = Eleitor.find(params[:id])

SELECT * FROM `eleitors` WHERE (`eleitors`.`id` = 1)
---
  def edit
    @eleitor = Eleitor.find(params[:id])

INSERT INTO `eleitors` (`created_at`, `cod_func`, `data_nasc`, `tit_eleitor`, `nome`, `cpf`, `cod_bio`, `updated_at`, `cod_secao`, `cod_zona`, `rg`) VALUES('2010-11-02 16:01:55', NULL, 12, 1234, 'rodrigo', 12312312321, '', '2010-11-02 16:01:55', 123, 1234, 12312312321)
---
  def create
    @eleitor = Eleitor.new(params[:eleitor])

    respond_to do |format|
      if @eleitor.save

SELECT * FROM `eleitors` WHERE (`eleitors`.`id` = 1)
UPDATE `eleitors` SET `updated_at` = '2010-11-02 15:17:27', `nome` = 'Rodrigo', `cod_func` = 123, `rg` = 4123123213, `cod_bio` = '213123213', `cpf` = 12312312321, `cod_secao` = 123 WHERE `id` = 1
---
  def update
    @eleitor = Eleitor.find(params[:id])

    respond_to do |format|
      if @eleitor.update_attributes(params[:eleitor])

SELECT * FROM `eleitors` WHERE (`eleitors`.`id` = 2)
DELETE FROM `eleitors` WHERE `id` = 2
---
  def destroy
    @eleitor = Eleitor.find(params[:id])
    @eleitor.destroy