app/controllers/municipios_controller.rb

  def show
    @municipio = Municipio.find(params[:id])
---
SELECT * FROM `municipios` WHERE (`municipios`.`id` = 1)

  def edit
    @municipio = Municipio.find(params[:id])
---
SELECT * FROM `municipios` WHERE (`municipios`.`id` = 1)

  def create
    @municipio = Municipio.new(params[:municipio])

    respond_to do |format|
      if @municipio.save
---
INSERT INTO "municipios" ("cod_est", "created_at", "updated_at", "cod_munic", "nome_munic") VALUES(1, '2010-09-21 11:41:57', '2010-09-21 11:41:57', NULL, 'São Paulo')

  def update
    @municipio = Municipio.find(params[:id])

    respond_to do |format|
      if @municipio.update_attributes(params[:municipio])
---
SELECT * FROM `municipios` WHERE (`municipios`.`id` = 5)
UPDATE `municipios` SET `updated_at` = '2010-11-08 10:46:47', `nome_munic` = 'Batataiss' WHERE `id` = 5