app/controllers/partidos_controller.rb

  def show
    @partido = Partido.find(params[:id])
---
SELECT * FROM `partidos` WHERE (`partidos`.`id` = 1)

  def edit
    @partido = Partido.find(params[:id])
---
SELECT * FROM `partidos` WHERE (`partidos`.`id` = 1)

  def create
    @partido = Partido.new(params[:partido])

    respond_to do |format|
      if @partido.save
---
INSERT INTO `partidos` (`endereco`, `pres_nacional`, `telefone`, `created_at`, `comp_colig`, `updated_at`, `nome_partido`, `end_internet`, `coligacao`, `sigla`) VALUES('teste', 'rodrigo', 123, '2010-09-30 22:19:44', 'tse', '2010-09-30 22:19:44', 'PST', 'www.pst.gov.br', 'ptt', 'PST')

  def update
    @partido = Partido.find(params[:id])
---
SELECT * FROM `partidos` WHERE (`partidos`.`id` = 1)