app/controllers/secaos_controller.rb

SELECT * FROM `secaos` WHERE (`secaos`.`id` = 1)
---
  def show
    @secao = Secao.find(params[:id])

SELECT * FROM `secaos` WHERE (`secaos`.`id` = 1)
---
  def edit
    @secao = Secao.find(params[:id])

INSERT INTO `secaos` (`urna_id`, `created_at`, `municipio_id`, `estado_id`, `sala`, `updated_at`, `zona_id`) VALUES(1, '2010-09-30 22:02:37', 1, 1, '122', '2010-09-30 22:02:37', 231)
---
  def create
    @secao = Secao.new(params[:secao])

    respond_to do |format|
      if @secao.save

SELECT * FROM `secaos` WHERE (`secaos`.`id` = 1)
UPDATE `secaos` SET `updated_at` = '2010-10-01 14:10:31', `zona_id` = 2 WHERE `id` = 1
---
  def update
    @secao = Secao.find(params[:id])

    respond_to do |format|
      if @secao.update_attributes(params[:secao])