app/controllers/zonas_controller.rb

  def show
    @zona = Zona.find(params[:id])
---
SELECT * FROM `zonas` WHERE (`zonas`.`id` = 1)

  def edit
    @zona = Zona.find(params[:id])
---
SELECT * FROM `zonas` WHERE (`zonas`.`id` = 1)

  def create
    @zona = Zona.new(params[:zona])

    respond_to do |format|
      if @zona.save
---
INSERT INTO `zonas` (`cod_est`, `created_at`, `updated_at`, `cod_zona`, `cod_munic`, `nome_zona`) VALUES(1, '2010-09-21 12:07:51', '2010-09-21 12:07:51', 1, 1, '231')

  def update
    @zona = Zona.find(params[:id])

    respond_to do |format|
      if @zona.update_attributes(params[:zona])
---
SELECT * FROM `zonas` WHERE (`zonas`.`id` = 2)
UPDATE `zonas` SET `updated_at` = '2010-09-30 23:04:49', `nome_zona` = '432' WHERE `id` = 2

  def destroy
    @zona = Zona.find(params[:id])
    @zona.destroy
---
SELECT * FROM `zonas` WHERE (`zonas`.`id` = 1)
DELETE FROM `zonas` WHERE `id` = 1